import 'package:damnosh/models/data_models.dart';

Map homePagePosterMap={
 "groupDamnosh": "AramBakhsh",
 "imageAsset": "assets/images/Herbal-teas.jpg",
 "likeDamnosh": "235",
 "date": "یک روز پیش",
 "title": "دمنوش گیاهی آرام بخش",

};

List<HashTagModel> tagList =
[
  HashTagModel(title: 'چای'),
  HashTagModel(title: 'دمنوش درمانی'),
  HashTagModel(title: 'دمنوش لاغری'),
  HashTagModel(title: 'دمنوش آرام بخش'),
  HashTagModel(title: 'دمنوش چاقی'),
  HashTagModel(title: 'دمنوش مخنلف'),
];

List<DamnoshModel> damnoshlist=
[
  DamnoshModel(id: 1, imageUrl: "assets/images/imgdamnosh1.jpg", title: 'دمنوش آرام بخش', writer: 'بهروز', writerImageUrl: 'assets/images/wr.jpg', date: 'date', content: 'content', views: '102'),
  DamnoshModel(id: 2, imageUrl: "assets/images/imgdamnosh2.jpg", title: 'چای بابونه تقیت کننده معده', writer: 'بهروز', writerImageUrl: 'assets/images/wr.jpg', date: 'date', content: """گیاه بابونه به مادر گیاهان معروف است و این شهرت را به دلیل داشتن خواص بسیار دارد. بابونه گیاهی است که در طب سنتی بسیار مورد استفاده قرار میگرفته است و از این گیاه اعجازانگیز استفاده های زیادی میشده است. مشهورترین خواص بابونه را میتوانیم تقویت کننده معده و ترمیم کننده زخم بدانیم بابونه خواص مفیدی برای پوست و مو هم دارد.
چای بابونه را میتوانید به صورت روزانه مصرف کنید و  به دلیل خواص ضد التهابی و ترمیم کنندگی زخم میتواند یک تقویت کننده قوی برای معده باشد و به تسکین درد معده کمک کند.
در این دمنوش ترکیبی گیاه بابونه در کنار گیاهان دیگری از جمله گل محمدی و بهلیمو قرار گرفته و اثر ضد التهابی بیشتری پیدا کرده است و این چای را یک چای تقویت کننده معده و کمک کننده به هضم غذا کرده است.
ترکیبات:
بابونه، گل محمدی، بهلیمو
بهترین زمان مصرف چای گیاهی بابونه چه زمانی است؟
بهترین زمان مصرف چای بابونه قبل از ناهار و یا قبل شام میباشد.

طرز مصرف چای تقویت معده بابونه:
یک تی بگ هرمی چای بابونه را داخل یک لیوان آب جوش قرار دهید و ۱۰ دقیقه صبر کنید تا عصاره گیاهان تی بگ خارج شود.
بسته بندی
سایز بسته بندی 16عددی: 10 در 20 سانتی متر

سایز بسته بندی 40عددی: 20 در 25 سانتی متر""", views: '102'),
  DamnoshModel(id: 3, imageUrl: "assets/images/imgdamnosh3.jpg", title: 'چای معطر و نشاط آور', writer: 'بهروز', writerImageUrl: 'assets/images/wr.jpg', date: 'date', content: """چای معطر به دلیل داشتن محتویات معطر از جمله هل، غنچه، بهار نارنج و دارچین یک ترکیب خوش عطر به وجود آورده، گیاهانی که در این ترکیب هستند به دلیل داشتن عطر خوب و خواص دیگر به بازیابی انرژی بدن و کاهش اضطراب کمک میکنند و خواص ضد افسردگی دارند.

چای معطر و نشاط آور
این چای در تی بگ های هرمی قرار گرفته است که از ابریشم میباشند و در آب جوش طعمی ندارد و میتوان با یک فنجان آب جوش این نوشیدنی را آماده و نوش جان کرد.
به دلیل محتویات معطر این چای نشاط آور میتوان این دمنوش را به تنهایی و فقط با یک فنجان آب جوش و یا همراه با چای به عنوان طعم دهنده به چای استفاده کرد.
شیوه دم آوری 

یک تی بگ هرمی را داخل یک لیوان آب جوش قرار دهید و 5 دقیقه صبر کنید، حالا دمنوش شما آماده است.
بسته بندی
سایز بسته بندی 16عددی: 10 در 20 سانتی متر

سایز بسته بندی 40عددی: 20 در 25 سانتی متر""", views: '302'),
  DamnoshModel(id: 4, imageUrl: "assets/images/imgdamnosh4.jpg", title: 'چای ماچا تشریفاتی', writer: 'بهروز', writerImageUrl: 'assets/images/wr.jpg', date: 'date', content: """خواص چای ماچا: آرامش، تمرکز اعصاب، چربی سوزی،سرشار از آنتی اکسیدان ( چای ماچا ۱۰ برابر چای سبز آنتی اکسیدان دارد، آنتی
اکسیدان جوان کننده است)
چای ماچا نوشیدنی سنتی مردم ژاپن است که به علت کشت این گیاه در سایه دارای کلروفیل بسیار بالایی میباشد. این امر باعث ایجاد خواص زیادی در این نوشیدنی میشود طعم این چای شبیه به طعم چای سبز همراه با یک شرینی پنهان در مزه ی آن است. این نوشیدنی دارای مقادیر بسیار بالای آنتی اکسیدان می باشد. به صورتی که یک لیوان چای ماچا معادل ۱۰ برابر یک لیوان چای سبز آنتی اکسیدان دارد. علاوه بر داشتن آنتی اکسیدان بالا این چای خواص چربی سوزی زیادی دارد که این نوشیدنی را برای افرادی که به دنبال کاهش وزن و لاغری هستند گزینه ی بسیار ایده آلی کرده است. 
چای ماچا دارای کیفیت های مختلفی است و به اصطلاح گریدهای متفاوتی دارد، پودر چای ماچا تشریفاتی نسبت به ماچای نرمال درجه کیفیت بالاتری دارد و غلظت آن بیشتر است، رنگ آن نیز سبزتر است.
طرز درست کردن ماچا: 
1. برای درست کردن یک لیوان چای ماچا ابتدا مقدار یک گرم از پودر ماچا نیاز دارید. به وسیله ی قاشق چاشاکو میتوانید مقدار یک گرم مورد نظر را بردارید. در صورتی که قاشق چاشاکو در دسترس نیست به وسیله یک قاشق چایخوری به طور تقریبی یک گرم بردارید.
2. مقداری آب داغ (10تا 20میلی لیتر) را با دمای تقریبی 80 درجه سانتی گراد در کاسه بریزید. (به طور سنتی از کاسه بامبو استفاده میشود)
3. با ویسک کاملا هم بزنید. (ویسک همزنی از جنس بامبو است که مخصوص هم زدن چای ماچا می باشد علاوه بر ویسک از کف ساز استیل هم میتوانید استفاده کنید) در صورتی که ویسک یا کف ساز در دسترس نیست میتوانید از چنگال برای هم زدن استفاده کنید.
4. مقدار بیشتری آب داغ اضافه کنید.
5. همزن را به شکل W در ظرف حرکت دهید.
6. نوشیدنی آماده است.
ترکیبات : پودر چای ماچا تشریفاتی
نوع بسته بندی: قوطی
میزان مصرف: ۱ گرم برای هر فنجان
دفعات مصرف به منظور چربی سوزی: دوبار در روز، یکبار همراه با صبحانه و یکبار عصر""", views: '256'),
  DamnoshModel(id: 5, imageUrl: "assets/images/imgdamnosh5.jpg", title: 'چای ماسالا تاج محل', writer: 'بهروز', writerImageUrl: 'assets/images/wr.jpg', date: 'date', content: """چای ماسالا چای خوش طعم و عطر از کشور هندوستان است. این چای که حاوی ادویه های معطری مثل هل، زنجبیل، میخک، دارچین و ادویه های هندی است پر انرژی و نشاط آور است. وجود ادویه ها و ترکیب آنها علاوه بر ایجاد یک طعم دلنشین پر از خاصیت برای مصرف کننده میباشد. برای تهیه این چای خوشمزه میتوانید از پودر چای ماسالا که حاوی چای و ادویه های معطر  و ادویه های هندی مخصوص چای ماسالا است استفاده کنید و سریع و آسان این نوشیدنی محبوب را تهیه کنید . چای ماسالا اسپایسی تندتر از کلاسیک میباشد و برای افرادی که به طعمهای تندتر علاقه مندند مناسب است. دمنوش ماسالا اسپایسی تاج محل کم شکر است و در بازار به عنوان ماسالای رژیمی ارائه میشود. چای اسپایسی تاج محل یک چای ارگانیک و سالم میباشد که شما را در دستیابی به خواص آن کمک میکند.

این چای ماسالا به دلیل کم شکر بودن در رژیم کتوژنیک نیز مورد استفاده قرار میگیرد.

طرز استفاده از پودر آماده چای ماسالا
پودر چای ماسالا را داخل شیر میریزیم، برای هر یک لیوان شیر یک قاشق پودر چای ماسالا اضافه میکنیم و خوب هم میزنیم تا پودر چای ماسالا کاملا در شیر حل شود، سپس این ترکیب را روی حرارت قرار میدهیم و در همین حین هم میزنیم تا شیر بجوشد اجازه بدهید شیر به همراه ترکیبات چای ماسالا ۵ دقیقه روی حرارت بجوشد و سپس آن را از روی حرارت بردارید، حالا چای ماسالا آماده است.

خواص چای ماسالا: کمک به هضم غذا، محافظت در مقابل سرماخوردگی و آنفلانزا، انرژی بخش، برطرف کننده ی خستگی و بیحالی، آرام بحش، بهبود درد مفاصل و...

طرز استفاده از پودر ماسالا: ۲۰ گرم ( یک قاشق پر چای خوری)  از پودر ماسالا را در 200 سی سی شیر مخلوط کنید و صبر کنید تا شیر بجوشد. چای ماسالا آمده است.

نوع: پودر ماسالا

برند: تاج محل

نوع: ارگانیک

مدل : اسپایسی

ترکیبات: چای، شیر، هل، زنجبیل، میخک، دارچین ، شکر (حداقل شکر) و دیگر ادویه های هندی.

وزن: 500 گرم

ساخت کشور : هندوستان

 ارزش غذایی در 100 گرم

کالری: 49.8 

 کل چربی:0.2 گرمی

چربی اشباع:0 گرم

سدیم: 286.8 میلی گرم

پتاسیم:153.8 میلی گرم

منیزیم:3.2%

منگنز:0.3%

ویتامین آ : 2.8%

ویتامین ب 12: 2.1%

ویتامین ب 6: 1.3%

ویتامین ث: 1.6%

ویتامین د:8.4%

ویتامین ای: 0.4%

کلسیم:11.3%""", views: '425'),
  DamnoshModel(id: 6, imageUrl: "assets/images/imgdamnosh6.jpg", title: 'دمنوش معطر و نشاط آور', writer: 'بهروز', writerImageUrl: 'assets/images/wr.jpg', date: 'date', content: """در صورتی که بخواهیم یک دمنوش معطر خوشمزه درست کنیم اول به سراغ گیاهان خوش عطر میرویم در ضمن ترکیب کردن گیاهان باید به این توجه کنیم که گیاهان باهم سازگاری داشته باشند بهترین انتخاب این است که به سراغ دستورهای معتبر از ترکیب های گیاهی برویم . در اینجا به یک ترکیب دلنشین معطر از دمنوش ها میپردازیم :
 گیاه اصلی که مورد نیاز است غنچه گل محمدی است که از عصاره ی برگهای تازه ی آن گلاب بدست میاید. اگر برگهای خشک شده ی گل محمدی را دارید میتوانید از گل برگ های خشک شده استفاده کنید. ممکن است پودر آن را داشته باشید که بهتر است از پودر درشت استفاده کنید چون پودر ریز موقع صاف کردن چای از صافی رد میشود و چای را کدر میکند. هرچه برگها درشت تر باشند بهتر است.
حالا نوبت دانه های هل است قبل از اضافه کردن دانه های هل اگر میخواهید همزمان چای را هم دم کنید دانه ی هل را با یک ضربه هاون بشکنید تا عطر آن بهتر خارج شود.
هنگام اضافه کردن چوب دارچین چوب ها را بشکنید به اندازه های کوچکتر تقسیم کنید هیچ وقت از پودر دارچین استفاده نکنید پودر دارچین باعث کدر شدن چای میشود.
بهار نارنج را با احتیاط اضافه کنید اضافه کردن مقدار زیاد بهار نارنج باعث تلخی در چای میشود پس فقط در حدی اضافه کنید که چند برگ بهارنارنج در هر فنجان چای قرار بگیرد.


خاصیت گل محمدی: گل محمدی به دلیل داشتن عطر دلپذیر در بسیاری از غذاها و نوشیدنی ها مورد استفاده قرار میگرفته. گل محمدی از زمان های قدیم به عنوان یک دمنوش سنتی مورد استفاده بوده است، خواص گل محمدی: کاهش استرس و افسردگی، تقویت قلب، افزایش متابولیسم 
خاصیت هل: هل علاوه بر دمنوش در غذاها به عنوان ادویه مورد استفاده قرار میگیرد. زادگاه هل آسیایی است و مانند زعفران و وانیل به دلیل عطر خوش اش در جهان بسیار پر طرفدار شده است. از جمله خواص هل، نشاط آور بودن، خاصیت ضد میکروبی و مقوی معده بودن است. 
خواص دارچین: دارچین طعم و عطر خوشی دارد ، طبع دارچین گرم است و در بسیاری از دمنوش های سنتی در ترکیبات قرار داشته.  بعضی از خواص دارچین : کاهنده علائم سرماخوردگی، مناسب برای ضعف پاها، کاهش دهنده درد مفاصل، نشاط آور
خواص بهارنارنج: بهارنارنج همان شکوفه های درخت نارنج است که از آن عرق بهارنارنج گرفته میشود و یا گل برگهای کوچک خشک میشود و به عنوان دمنوش مورد استفاده قرار میگیرد.  دمنوش بهارنارنج برای آرامش اعصاب و همین طور تپش نا منظم قلب مناسب است. 
ترکیبات دمنوش نشاط آور: غنچه گل محمدی+بهارنارنج+هل+دارچین 
 این دمنوش بسیار خوش عطر و خوش طعم است و به محض اینکه درب شیشه را باز کنید عطر خوش در فضا پراکنده میشود. این نوشیدنی علاوه بر طعم و عطر بی نظیر سرشار از ویتامین ها و مواد معدنی است.
 آماده کردن این چای معطر باعث میشود عطر خوش آن از فنجان چای به مشام برسد. عطر خوش، باعث ایجاد حس آرامش و نشاط  میشود. عطر های خوش تنش های عصبی را کاهش میدهد، این ترکیب بی نظیر باعث تقویت سیستم عصبی و دور کردن فشارهای عصبی میشود و احساس نشاط و سر زندگی به وجود می آورد. همچنین این چای نشاط آور باعث افزایش سلامت قلب و تقویت قوای قلب و عروق میگردد. 
سایز شیشه بزرگ: ارتفاع 19 سانتی متر قطر7سانتی متر
سایز شیشه کوچک: ارتفاع 13 سانتی متر قطر7سانتی متر
طرز دم آوری دمنوش معطر و نشاط آور: قبل از ریختن آب جوش بر روی گیاهان بهتر است دانه ی هل را بشکنید تا عطر آن بهتر خارج شود و سپس یک قاشق چای خوری دمنوش را به یک لیوان آب جوش اضافه کنید و ۵تا ۱۰ دقیقه زمان بدهید تا عصاره گیاهان خارج شود. این دمنوش برای دم کشیدن نیاز به حرارت مجدد ندارد اما در صورتی که از این دمنوش همراه با چای سیاه جهت معطر کردن چای سیاه استفاده میکنید میتوانید اجازه دهید گیاهان معطر همراه با چای سیاه دم بکشند.""", views: '523'),
];